# Zoom Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIView..::..Zoom Method
UIView Class See Also
---
Zoom the view.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void Zoom(
	double zoomFactor
)
```

Visual Basic
---
```text
Public Sub Zoom ( _
	zoomFactor As Double _
)
```

Visual C++
---
```text
public:
void Zoom(
	double zoomFactor
)
```

# ### Parameters
zoomFactor
    Type: System..::..Double Factor by which to zoom in or out. Values greater than 1 zooms in, less than 1 zooms out.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | zoomFactor is not positive. |

# See Also
UIView Class
Autodesk.Revit.UI Namespace